# ЭТАП 1: Сборка (Здесь мы компилируем код)
# СТАЛО:
FROM golang:1.26-alpine AS builder

# Создаем папку внутри контейнера
WORKDIR /app

# Копируем файлы зависимостей (чтобы кэшировать их скачивание)
COPY go.mod go.sum ./
RUN go mod download

# Копируем весь исходный код
COPY . .

# Компилируем статический бинарник (CGO_ENABLED=0 важен для Alpine Linux)
# Убедись, что путь ./cmd/bot/main.go правильный, если у тебя main лежит в другом месте - поправь
RUN CGO_ENABLED=0 GOOS=linux go build -o soc-assistant ./cmd/bot/main.go

# ЭТАП 2: Запуск (Здесь мы создаем легкий контейнер только для запуска)
FROM alpine:latest

WORKDIR /root/

# Копируем только готовый бинарник из первого этапа
COPY --from=builder /app/soc-assistant .

# Копируем .env файл (если он у тебя есть в корне), чтобы бот мог читать переменные
# Если ты передаешь переменные через docker-compose, эту строку можно пропустить
COPY .env .

# Открываем порт, на котором висит твой HTTP сервер
EXPOSE 8080

# Команда, которая запустится при старте контейнера
CMD ["./soc-assistant"]